app/Controllers/carrito_controller.php

SELECT *
FROM `productos`
WHERE `productos`.`id` = '6'
---
   public function agregar($id = null)
{
    $productoModel = new producto_model();
    $producto = $productoModel->find($id);

INSERT INTO `ventas_detalle` (`venta_id`, `producto_id`, `cantidad`, `precio`) VALUES (27, '6', 1, 550000)
---
   public function comprar()
{
    $cartItems = $this->cart->contents();

    if (empty($cartItems)) {
        return redirect()->back()->with('mensaje', 'El carrito está vacío.');
    }

    $cabeceraModel = new Ventas_cabecera_model();
    $detalleModel  = new Ventas_detalle_model();

    $id_usuario = $this->session->get('id_usuario');
    $total      = $this->cart->total();


    $venta_id = $cabeceraModel->insertarCabecera($id_usuario, $total);


    foreach ($cartItems as $item) {
        if (!isset($item['id'])) {
            continue;
        }

        $detalleModel->insert([
            'venta_id'    => $venta_id,
            'producto_id' => $item['id'],
            'cantidad'    => $item['qty'],
            'precio'      => $item['price'],
        ]);

SELECT *
FROM `productos`
WHERE `productos`.`id` = '7'
---
     public function mis_compras()
    {

        $session = session();
        $id_usuario = $session->get('id_usuario');

        $ventasModel = new ventas_cabecera_model();
        $detallesModel = new ventas_detalle_model();
        $productoModel = new producto_model();

        // Trae todas las ventas del usuario
        $ventas = $ventasModel
            ->where('id_usuario', $id_usuario)
            ->orderBy('fecha', 'DESC')
            ->findAll();


        $compras = [];

        foreach ($ventas as $venta) {
            $items = [];

            $detalles = $detallesModel->where('venta_id', $venta['venta_id'])->findAll();

            foreach ($detalles as $detalle) {
                $producto = $productoModel->find($detalle['producto_id']);