app/Controllers/Consultas_controller.php

SELECT *
FROM `consultas`
---
    public function listar()
    {
        $modelo = new Consulta_model();
        $data['consultas'] = $modelo->findAll();