app/Controllers/VentasController.php

SELECT `ventas_cabecera`.*, `usuario`.`nombre`, `usuario`.`apellido`
FROM `ventas_cabecera`
JOIN `usuario` ON `usuario`.`id_usuario` = `ventas_cabecera`.`id_usuario`
---
    public function index()
    {
        $cabeceraModel = new ventas_cabecera_model();
        $db = \Config\Database::connect();
        $builder = $db->table('ventas_cabecera');
        $builder->select('ventas_cabecera.*, usuario.nombre, usuario.apellido');
        $builder->join('usuario', 'usuario.id_usuario = ventas_cabecera.id_usuario');
        $query = $builder->get();

SELECT `ventas_detalle`.*, `productos`.`nombre_prod` as `producto_nombre`
FROM `ventas_detalle`
JOIN `productos` ON `productos`.`id` = `ventas_detalle`.`producto_id`
WHERE `venta_id` = '20'
---
    public function detalle($venta_id)
    {
        $detalleModel = new ventas_detalle_model();
        $db = \Config\Database::connect();

        $builder = $db->table('ventas_detalle');
        $builder->select('ventas_detalle.*, productos.nombre_prod as producto_nombre');
        $builder->join('productos', 'productos.id = ventas_detalle.producto_id');
        $builder->where('venta_id', $venta_id);
        $query = $builder->get();