app/Models/producto_model.php

    public function obtenerProductosConCategoria()
    {
        return $this->select('productos.*, categorias.descripcion AS nombre_categoria')
                ->join('categorias', 'categorias.id = productos.categoria_id')
                ->where('productos.eliminado', 'NO')
                ->findAll();
---
SELECT `productos`.*, `categorias`.`descripcion` AS `nombre_categoria`
FROM `productos`
JOIN `categorias` ON `categorias`.`id` = `productos`.`categoria_id`
WHERE `productos`.`eliminado` = 'NO'