app/Models/ventas_cabecera_model.php

INSERT INTO `ventas_cabecera` (`id_usuario`, `fecha`, `total_venta`) VALUES ('5', '2025-06-19 01:42:55', 550000)
---
    public function insertarCabecera($id_usuario, $total)
    {
        $data = [
            'id_usuario' => $id_usuario,
            'fecha'      => date('Y-m-d h:i:s'),
            'total_venta'      => $total
        ];

        $this->insert($data);